{
  "teamMembers": [
    {
      "id": "austin-daniel",
      "name": "Austin Daniel",
      "title": "Chief Growth Officer",
      "avatar": "AD",
      "profileImage": "https://i.imgur.com/nDs6MPO.jpg",
      "offering": "Embedded Teams",
      "nicheStatement": "You speak to revenue leaders and founders scaling B2B sales organizations — specifically those navigating the transition from founder-led sales to repeatable, scalable go-to-market engines across multiple verticals.",
      "icp": {
        "title": "CROs, VPs of Sales, startup founders scaling from founder-led sales",
        "targetRoles": [
          "CROs",
          "VPs of Sales",
          "Heads of Revenue",
          "Startup Founders (Series A-C)"
        ],
        "companyStage": "20–500 employees, $2M–$50M ARR",
        "industry": "SaaS, B2B tech, enterprise software",
        "situation": "Scaling from founder-led sales to a structured sales org; expanding into new verticals; struggling with forecasting, hiring, or tooling",
        "theyrePostingAbout": [
          "Scaling sales teams without losing quality",
          "VP of Sales hiring decisions",
          "Revenue forecasting challenges",
          "Sales and marketing alignment"
        ],
        "servicesFocus": [
          "Embedded"
        ]
      },
      "connectCriteria": [
        "Are evaluating when to hire their first VP of Sales",
        "Have a sales team scaling past 5 reps and need process discipline",
        "Post about forecasting accuracy or pipeline reliability",
        "Mention 'founder-led sales' transition or sales hiring challenges",
        "Recently raised Series A-C and are building go-to-market"
      ],
      "engageCriteria": [
        "Generally interested in sales strategy and leadership",
        "Share content about revenue operations or sales metrics",
        "Post about CRM or sales tooling frustrations",
        "Discuss sales team culture or motivation challenges"
      ],
      "painPoints": [
        {
          "id": 1,
          "title": "Scaling sales teams without losing quality or culture",
          "whyItMatters": "Founders and CROs consistently struggle with growing sales teams without degrading process adherence or rep quality. Rushing hiring leads to chaos; going too slowly means missed revenue targets.",
          "quotes": [
            {
              "text": "A challenge that comes up while scaling a sales team is in process execution. Are people following the process that they've been trained on? Are managers coaching to that process? Is everyone executing this at the same time?",
              "attribution": "Brandon Calley, VP of Sales at Qualia (QuotaPath blog)"
            },
            {
              "text": "Asking sales reps to do everything, from marketing to qualification to outbound to inbound. Sometimes you have no choice in the early days, but specialize as soon as possible. Closers are good at closing. Openers are good at opening. No sales professional is great at all of it.",
              "attribution": "Jason Lemkin, Founder of SaaStr (SaaStr community)"
            }
          ],
          "postAngles": [
            "Share your framework for knowing when to specialize vs. generalize your sales roles",
            "Tell a story about a sales team that scaled too fast and what broke",
            "Break down the metrics that indicate your sales process is degrading",
            "Outline what 'process adherence' actually looks like at different scales"
          ]
        },
        {
          "id": 2,
          "title": "Hiring the wrong VP of Sales or first sales leaders",
          "whyItMatters": "The wrong sales leadership hire can set a startup back 6–12 months. Eight out of ten first VP Sales hires fail, averaging just 11 months in-role.",
          "quotes": [
            {
              "text": "Roughly about eight out of ten first VP Sales hires for startups will also fail. If you get it wrong, the consequences are essentially you're going to lose one year of your startup life. For most startups, that's the difference between life or death.",
              "attribution": "Brendon Cassidy, former VP Sales at LinkedIn/Talkdesk/Gong (SaaStr Scale presentation)"
            },
            {
              "text": "You need to hire someone that can actually build the process and the foundation… You don't need to hire that hot-shot executive. They may not be in the position to roll up their sleeves and do the dirty work that needs to get done in the zero to $10 million stage.",
              "attribution": "Doug Landis, Growth Partner at Emergence Capital (Avenue Talent Partners)"
            }
          ],
          "postAngles": [
            "Create a 'VP of Sales interview scorecard' — questions that expose builders vs. managers",
            "Tell the story of a VP Sales hire gone wrong and the warning signs you missed",
            "Share the profile of what a 'first VP of Sales' actually needs to be able to do",
            "Explain why big-company sales execs often fail at startups"
          ]
        },
        {
          "id": 3,
          "title": "Revenue forecasting is unreliable and high-stakes",
          "whyItMatters": "Deals slip, pipeline is unreliable, and boards demand predictability that's nearly impossible in growth-stage companies. CROs walk into board meetings armed with forecasts only to explain why 30% of 'committed' deals disappeared.",
          "quotes": [
            {
              "text": "Two massive contracts made up nearly 70% of our projected quarterly revenue. Both had verbal buy-in, and we'd already lined up resources assuming they'd close. Then one got delayed by six months… Overnight, our actual revenue came in 40% below forecast.",
              "attribution": "Gregory Cave, AVP Healthcare Solutions, OSP Labs (Indinero)"
            },
            {
              "text": "The sales cycle isn't linear; it's unpredictable by design. Prospects go quiet for weeks, then come back ready to sign. Budgets shift mid-quarter. Decision-makers change roles.",
              "attribution": "Vito Vishnepolsky, Founder & Director, Martal Group (Indinero)"
            }
          ],
          "postAngles": [
            "Share your forecasting methodology and how accurate it actually is",
            "Tell a story about a forecast miss and what you learned",
            "Create a 'deal confidence scoring' framework your audience can steal",
            "Explain how to have honest conversations with your board about forecast uncertainty"
          ]
        },
        {
          "id": 4,
          "title": "Sales and marketing misalignment destroys revenue",
          "whyItMatters": "Growth departments operating in silos — where marketing blames sales for not closing and sales blames marketing for poor leads — is a pervasive, costly problem.",
          "quotes": [
            {
              "text": "Marketing say Sales aren't closing enough deals with the leads they're handing over. Sales say Marketing aren't generating good enough leads. Customer Success say they can't retain customers because Sales are closing deals at all costs.",
              "attribution": "Cobloom (SaaS growth consultancy)"
            }
          ],
          "postAngles": [
            "Share the one meeting that fixed sales/marketing alignment at your company",
            "Create a 'lead quality definition' template both teams can agree on",
            "Tell a story about the cost of misalignment you've witnessed",
            "Outline specific handoff processes that prevent finger-pointing"
          ]
        },
        {
          "id": 5,
          "title": "CRM and sales tooling frustrations",
          "whyItMatters": "Sales reps widely dislike CRMs. Tools are built for managers, not sellers. Tool sprawl creates friction rather than enablement, and the effort to adopt new sales SaaS is rarely justified.",
          "quotes": [
            {
              "text": "I rarely make or sponsor a sales SaaS purchase. Is it budget? Lack of need? The answer is: all of these, and more. The potential benefit to my business is either marginal or unproven and therefore not worth the effort.",
              "attribution": "James Fielding, Former Head of Sales Enablement (Sales Enablement Collective)"
            }
          ],
          "postAngles": [
            "Share your 'essential vs. nice-to-have' sales tool framework",
            "Tell a story about killing a tool that everyone thought was necessary",
            "Create a CRM adoption checklist that actually gets reps to use it",
            "Explain how to evaluate if a new sales tool is worth the switching cost"
          ]
        }
      ],
      "realQuotes": [
        {
          "topic": "Sales scaling chaos",
          "source": "QuotaPath blog, SaaStr",
          "context": "Leaders struggling with process execution as teams grow"
        },
        {
          "topic": "VP Sales hiring failures",
          "source": "SaaStr Scale, industry data",
          "context": "8/10 first VP Sales hires fail, averaging 11 months in-role"
        },
        {
          "topic": "Forecast unreliability",
          "source": "Indinero, CRO forums",
          "context": "Revenue leaders explaining forecast misses to boards"
        },
        {
          "topic": "Sales/Marketing blame game",
          "source": "Cobloom, LinkedIn",
          "context": "Silos destroying revenue with finger-pointing"
        }
      ],
      "topicCalendar": [
        {
          "category": "Sales Scaling Strategy",
          "frequency": "1x per week",
          "whenToPost": "After you see hiring announcements, sales team growth posts, or scaling challenges shared",
          "painPointsAddressed": [
            1,
            2
          ],
          "templateSuggestions": [
            "Hot Take",
            "Story Post",
            "Listicle"
          ],
          "exampleTopics": [
            "The #1 sign your sales team is scaling too fast",
            "Why your first VP of Sales probably shouldn't be from a big company",
            "3 process changes that fixed our scaling chaos"
          ]
        },
        {
          "category": "Revenue Forecasting",
          "frequency": "1x per week",
          "whenToPost": "End of quarter, board meeting seasons, when you see forecast miss complaints",
          "painPointsAddressed": [
            3
          ],
          "templateSuggestions": [
            "Value Bomb",
            "Myth Buster",
            "Signal Post"
          ],
          "exampleTopics": [
            "How we improved forecast accuracy from 60% to 85%",
            "The 'committed deal' lie we tell ourselves",
            "5 signs your pipeline is less healthy than you think"
          ]
        },
        {
          "category": "GTM Alignment",
          "frequency": "1x per week",
          "whenToPost": "When you see sales/marketing conflict posts, lead quality complaints",
          "painPointsAddressed": [
            4,
            5
          ],
          "templateSuggestions": [
            "Observation",
            "Question Post",
            "Story Post"
          ],
          "exampleTopics": [
            "The meeting that finally aligned our sales and marketing teams",
            "Why your CRM is a glorified spreadsheet (and what to do about it)",
            "Quick question: How do you define a 'qualified lead'?"
          ]
        }
      ],
      "proTips": {
        "superpower": "You've built sales organizations from founder-led to structured go-to-market engines. You speak the language of both scrappy founders and process-driven sales leaders.",
        "uniqueVoice": [
          "You've lived the founder-led sales grind and know the exact moment it breaks",
          "You can translate between founder intuition and sales process discipline",
          "You've made the VP Sales hiring mistake and can help others avoid it"
        ],
        "avoid": [
          "Generic sales motivation content ('hustle harder!')",
          "Pure theory without operational specifics",
          "Bashing competitors or vendors by name"
        ],
        "leanInto": [
          "Specific numbers from your experience (conversion rates, ramp times, forecast accuracy)",
          "Honest stories about what went wrong, not just wins",
          "Frameworks and templates your audience can immediately use",
          "Contrarian takes on common sales advice"
        ],
        "bestTimes": "Tuesday–Thursday, 7-9am or 12-2pm CT",
        "engagementHack": "When commenting on sales posts, add a specific number or timeframe from your experience. Example: 'We saw this exact pattern — took us 6 months to realize the fix was role specialization, not more training.'"
      },
      "closingMotivation": "Your audience is drowning in generic sales advice and desperately needs someone who's actually built what they're trying to build. Be specific. Be honest about failures. Give them frameworks they can use Monday morning."
    },
    {
      "id": "austin-eidson",
      "name": "Austin Eidson",
      "title": "Design Director",
      "avatar": "AE",
      "profileImage": "https://i.imgur.com/vT4FWrI.jpg",
      "offering": "Embedded Teams",
      "nicheStatement": "You speak to design leaders navigating the tension between creative vision and business reality — those fighting to prove design's strategic value while managing teams, brand systems, and organizational politics.",
      "icp": {
        "title": "Design Directors, Heads of Product Design, VPs of Design",
        "targetRoles": [
          "Design Directors",
          "Heads of Product Design",
          "VPs of Design",
          "Creative Directors"
        ],
        "companyStage": "100–5,000+ employees with in-house design teams of 5–50+",
        "industry": "Tech, SaaS, DTC brands, agencies",
        "situation": "Defending design's seat at the table; scaling design teams; battling speed-over-quality culture; building or maintaining brand systems",
        "theyrePostingAbout": [
          "Design leadership and team scaling",
          "Proving design's business impact",
          "Brand consistency at scale",
          "Stakeholder management and politics"
        ],
        "servicesFocus": [
          "Embedded"
        ]
      },
      "connectCriteria": [
        "Lead or manage a product design team of 5+ people",
        "Post about design systems, UX consistency, or brand implementation challenges",
        "Mention design's business impact or stakeholder buy-in struggles",
        "Are scaling design output without proportional headcount growth",
        "Active in design leadership communities or conferences"
      ],
      "engageCriteria": [
        "Generally interested in design trends and inspiration",
        "Share concerns about design quality vs. speed pressures",
        "Post about burnout, team dynamics, or leadership challenges",
        "Discuss design tools, workflows, or process improvements"
      ],
      "painPoints": [
        {
          "id": 1,
          "title": "Design is consistently undervalued by the C-suite",
          "whyItMatters": "More than 60% of design leaders feel unsupported by C-suite partners. Design is still treated as a service function rather than a strategic one, and gaining influence remains an uphill battle.",
          "quotes": [
            {
              "text": "I don't think they truly understand how difficult it can be for the average designer who works at a company that doesn't see the value in design, or completely misunderstands it. I feel like we've been talking about a seat at the table for, what, ten years now? Something is fundamentally wrong.",
              "attribution": "u/DesignGang, Reddit r/UXDesign (Nov 2024)"
            },
            {
              "text": "Most are held down and back because value is attributed to Product or Engineering. They simply will always have more bodies than UX.",
              "attribution": "u/Negneal, Reddit r/UXDesign (Nov 2024)"
            }
          ],
          "postAngles": [
            "Share how you got design 'a seat at the table' (specific tactics, not platitudes)",
            "Tell a story about translating design value into executive language",
            "Create a framework for measuring design's business impact",
            "Address the uncomfortable truth: maybe the seat doesn't matter as much as influence"
          ]
        },
        {
          "id": 2,
          "title": "Design leadership burnout from emotional labor and politics",
          "whyItMatters": "Design leaders are burning out from being sandwiched between defending quality to stakeholders, managing team emotions, and navigating politics — leaving no time for design thinking.",
          "quotes": [
            {
              "text": "You're defending why good design takes time to stakeholders who want everything yesterday, while simultaneously pushing your team to move faster. You're absorbing everyone's stress... You become the emotional shock absorber for the entire organization, and there's nowhere for that pressure to go.",
              "attribution": "Jamie Rothwell, Medium (UX Management, 2024)"
            },
            {
              "text": "We champion user empathy, and understanding of pain points and struggles... and then when a designer talks about not having influence, we finger-wag at them and tell them they're not working hard enough.",
              "attribution": "u/IniNew, Reddit r/UXDesign (Nov 2024)"
            }
          ],
          "postAngles": [
            "Share your strategies for protecting your energy as a design leader",
            "Tell an honest story about burnout and what you changed",
            "Create boundaries templates for design leaders (what to say 'no' to)",
            "Address the irony of user empathy professionals ignoring their own wellbeing"
          ]
        },
        {
          "id": 3,
          "title": "Business metrics are overriding creative and emotional design",
          "whyItMatters": "Design leaders face increasing pressure to optimize for engagement metrics and speed rather than craft, meaning, and emotional resonance — the things that differentiate great brands.",
          "quotes": [
            {
              "text": "We're handing our design systems to growth teams so they can squeeze every last penny out of customers. We're optimizing our flows for clicks, not clarity. We stopped building tools and started building engagement traps… In many companies, the pursuit of growth is overshadowing the pursuit of meaning.",
              "attribution": "Fabricio Teixeira & Caio Braga, The State of UX in 2025 (UX Collective)"
            },
            {
              "text": "The quality of experience suffered due to shrinking budgets and overstretched Design Teams, pressured and measured against speed and volume over quality and impact. The result? An enterprise-wide erosion of trust.",
              "attribution": "Aquent Blog, 'Is your Design Team proving its value in 2025?'"
            }
          ],
          "postAngles": [
            "Share how you balance metric optimization with design integrity",
            "Tell a story about pushing back on 'dark pattern' requests",
            "Create a framework for when to prioritize craft vs. speed",
            "Address the tension between growth metrics and brand trust"
          ]
        },
        {
          "id": 4,
          "title": "Brand consistency collapses at scale",
          "whyItMatters": "As organizations grow, maintaining cohesive brand identity across multiple teams and products becomes a major operational challenge. Teams build parallel solutions independently, creating inconsistency.",
          "quotes": [
            {
              "text": "Sales teams end up using outdated decks because they grabbed whatever was in the shared drive… Operations starts pulling their own visuals because they couldn't find the right one… Leadership wonders why everything looks completely different every quarter.",
              "attribution": "Nicole Steffen Design (Blog, Jan 2026)"
            }
          ],
          "postAngles": [
            "Share your design system governance model that actually works",
            "Tell a story about brand consistency breaking down and how you fixed it",
            "Create a 'brand audit' checklist for scaling companies",
            "Address the operational side of design systems (not just the components)"
          ]
        },
        {
          "id": 5,
          "title": "The isolation of being the most senior design leader",
          "whyItMatters": "The most senior design leader often faces an isolating, uphill battle with limited support from peers who don't understand the design process.",
          "quotes": [
            {
              "text": "To be the most senior designer in a business is a tough, isolating job: it's not always the VP of design's fault there are big problems.",
              "attribution": "Scott Berkun, author of 'Why Design Is Hard' (Substack, Nov 2024)"
            },
            {
              "text": "Less budget, less people, more work. Designers asked to do more with less. Majority of leaders are not 'truly' happy. Taking roles 1 or 2 levels below true skill set. In-house design leadership seen as a luxury.",
              "attribution": "Tom Scott, Design Leadership Recruiter (LinkedIn, late 2023)"
            }
          ],
          "postAngles": [
            "Share how you built a peer support network outside your company",
            "Tell an honest story about the loneliness of design leadership",
            "Create a 'survival guide' for solo design leaders",
            "Address what design leaders need from their organizations (not just more budget)"
          ]
        }
      ],
      "realQuotes": [
        {
          "topic": "Design's seat at the table",
          "source": "Reddit r/UXDesign, industry forums",
          "context": "10+ years of fighting for strategic recognition"
        },
        {
          "topic": "Design leadership burnout",
          "source": "Medium, UX Management communities",
          "context": "Being the 'emotional shock absorber' for the org"
        },
        {
          "topic": "Metrics vs. meaning",
          "source": "UX Collective, State of UX 2025",
          "context": "Growth optimization overriding design integrity"
        },
        {
          "topic": "Solo design leader isolation",
          "source": "Scott Berkun, LinkedIn recruiters",
          "context": "Less budget, more work, no peer support"
        }
      ],
      "topicCalendar": [
        {
          "category": "Design Leadership & Influence",
          "frequency": "1x per week",
          "whenToPost": "When you see 'seat at the table' discussions, design org announcements, or leadership transitions",
          "painPointsAddressed": [
            1,
            5
          ],
          "templateSuggestions": [
            "Hot Take",
            "Story Post",
            "Observation"
          ],
          "exampleTopics": [
            "I stopped fighting for a 'seat at the table.' Here's what I did instead.",
            "The loneliest job in tech: being the only design leader",
            "How I got my CEO to understand design's value (finally)"
          ]
        },
        {
          "category": "Design Team Health & Sustainability",
          "frequency": "1x per week",
          "whenToPost": "When you see burnout discussions, layoff announcements, or 'do more with less' pressures",
          "painPointsAddressed": [
            2,
            3
          ],
          "templateSuggestions": [
            "Myth Buster",
            "Question Post",
            "Story Post"
          ],
          "exampleTopics": [
            "The boundaries I set that saved my sanity as a design leader",
            "Quick question: What's draining you most as a design leader right now?",
            "We optimized for clicks and lost our soul. Here's what we changed."
          ]
        },
        {
          "category": "Design Systems & Brand Operations",
          "frequency": "1x per week",
          "whenToPost": "When you see brand inconsistency complaints, design system discussions, or scaling challenges",
          "painPointsAddressed": [
            4
          ],
          "templateSuggestions": [
            "Value Bomb",
            "Listicle",
            "Signal Post"
          ],
          "exampleTopics": [
            "5 signs your design system is a document, not a system",
            "How we got 12 teams using the same brand assets (finally)",
            "The operational side of design systems nobody talks about"
          ]
        }
      ],
      "proTips": {
        "superpower": "You understand both the emotional/creative side of design AND the operational/business reality. You can speak to the craft while acknowledging the constraints.",
        "uniqueVoice": [
          "You're honest about the political realities of design leadership",
          "You blend brand design (emotional) with product design (functional)",
          "You've felt the isolation and burnout — you're not preaching from a pedestal"
        ],
        "avoid": [
          "Purely inspirational design content (pretty portfolios without context)",
          "Blaming non-designers for 'not getting it'",
          "Unrealistic advice that ignores budget/time constraints"
        ],
        "leanInto": [
          "Honest stories about the hard parts of design leadership",
          "Practical frameworks for proving design value",
          "Emotional resonance — your audience is tired and needs validation",
          "Specific tactics for stakeholder management and politics"
        ],
        "bestTimes": "Tuesday–Thursday, 8-10am or 12-2pm CT",
        "engagementHack": "When commenting on design leadership posts, share a specific number or outcome. Example: 'We had the same issue — took 6 months but we reduced brand asset requests by 70% with a simple governance change.'"
      },
      "closingMotivation": "Your audience is exhausted from fighting for recognition while managing teams and delivering results. Validate their struggle, share your scars, and give them tactical wins they can implement this week."
    },
    {
      "id": "jerrod-tracy",
      "name": "Jerrod Tracy",
      "title": "Director of Engineering",
      "avatar": "JT",
      "profileImage": "https://i.imgur.com/AG6WFl0.jpg",
      "offering": "Embedded Teams",
      "nicheStatement": "You speak to engineering leaders managing the tension between technical excellence and organizational scale — those responsible for infrastructure reliability, team culture, and developer productivity as organizations grow.",
      "icp": {
        "title": "VPs of Engineering, CTOs, Directors of IT, Engineering Managers",
        "targetRoles": [
          "VPs of Engineering",
          "CTOs",
          "Directors of IT",
          "Engineering Managers"
        ],
        "companyStage": "50–2,000 employees with engineering teams of 15–200+",
        "industry": "SaaS, fintech, enterprise tech, infrastructure",
        "situation": "Scaling engineering orgs; managing technical debt; modernizing infrastructure; transitioning from IC to leader",
        "theyrePostingAbout": [
          "Technical debt and paying it down",
          "Infrastructure firefighting",
          "Engineering leadership transitions",
          "Hiring and retaining engineers"
        ],
        "servicesFocus": [
          "Embedded"
        ]
      },
      "connectCriteria": [
        "Lead engineering teams of 15+ people",
        "Post about technical debt decisions or modernization projects",
        "Mention capacity issues, hiring bottlenecks, or team burnout",
        "Discuss infrastructure upgrades or greenfield projects",
        "Active in engineering leadership communities"
      ],
      "engageCriteria": [
        "Generally interested in engineering management trends",
        "Share concerns about tech debt, legacy systems, or team dynamics",
        "Post about development velocity or process improvements",
        "Discuss engineering culture or retention challenges"
      ],
      "painPoints": [
        {
          "id": 1,
          "title": "Technical debt versus feature delivery — the impossible tradeoff",
          "whyItMatters": "Engineering leaders face constant tension between paying down technical debt and shipping features. Ignoring debt erodes team morale, increases attrition, and slows velocity — but justifying it to stakeholders is extremely difficult.",
          "quotes": [
            {
              "text": "Following an exit interview in which a departing engineer mentioned tech debt had contributed to their decision to leave, I started asking people during 1:1s how they felt about it. Their responses showed their frustration with me.",
              "attribution": "Lou Franco, Head of Development at Atalasoft (The Pragmatic Engineer Newsletter, Sept 2024)"
            },
            {
              "text": "One of the biggest challenges is just understanding and organizing the scope of technical debt… IT teams struggle with knowing the amount and impact of technical debt because it sprawls into different systems. It has knock-on effects.",
              "attribution": "Andrew Sharp, Research Director, Info-Tech Research Group (CIO.com)"
            }
          ],
          "postAngles": [
            "Share your framework for prioritizing tech debt vs. features",
            "Tell a story about tech debt that caused an engineer to leave",
            "Create a 'tech debt impact calculator' for justifying paydown to leadership",
            "Address how to have honest conversations with your team about debt"
          ]
        },
        {
          "id": 2,
          "title": "Infrastructure firefighting consumes engineering capacity",
          "whyItMatters": "Growing companies get trapped in reactive mode. Firefighting consumes up to 90% of engineering time at its worst, preventing proactive improvements and infrastructure modernization.",
          "quotes": [
            {
              "text": "When I arrived last year, it was probably 90% fire-fighting, and 10% actually improving things. Things are a lot better now days, so I'd say we're probably closer towards 60% 'near-term' issues and 40% 'longer-term' issues.",
              "attribution": "u/jedberg, Reddit r/sysadmin (AMA thread)"
            },
            {
              "text": "It would take 30+ hours for an engineer to spin up a cluster, including over 100 steps… Decommissioning a cluster amounted to an 'expensive archeology hunt.' It was a self-reinforcing cycle of inefficiency.",
              "attribution": "Harvey Xia, Software Engineer at Reddit (The New Stack, KubeCon)"
            }
          ],
          "postAngles": [
            "Share your journey from 90% firefighting to proactive engineering",
            "Create a 'firefighting ratio' metric and how to track it",
            "Tell a story about breaking the reactive cycle",
            "Outline specific automation that freed your team from firefighting"
          ]
        },
        {
          "id": 3,
          "title": "Losing technical edge while transitioning to leadership",
          "whyItMatters": "Engineering directors and managers struggle with losing their technical skills as they spend more time in meetings, on people management, and on strategy. This creates identity tension and limits effectiveness.",
          "quotes": [
            {
              "text": "Balancing performance appraisals with financial constraints and no bonuses. Keeping team spirits high during tough times and uncertainty. Making the tough decision to lay off employees when things got even worse financially.",
              "attribution": "Engineering Manager at a startup (Dev.to, Jan 2025)"
            },
            {
              "text": "This high-level focus doesn't materialize 100% of the time in practice. As a growing company, there are always gaps appearing in a company's management coverage, and I often become closely involved in running day-to-day operations.",
              "attribution": "Emily Nakashima, VP of Engineering at Honeycomb (LeadDev)"
            }
          ],
          "postAngles": [
            "Share how you stay technical while leading",
            "Tell an honest story about the identity crisis of going from IC to manager",
            "Create a framework for 'technical time' as a leader",
            "Address the guilt of not coding anymore"
          ]
        },
        {
          "id": 4,
          "title": "Hiring and retaining engineers amid burnout and tech debt frustration",
          "whyItMatters": "Poor hiring decisions slow teams, and attrition from burnout or tech debt frustration is costly. The cost of ignoring team sentiment is losing your best people.",
          "quotes": [
            {
              "text": "The cost of tech debt is borne daily by your team, and you risk damaging motivation and raising attrition by ignoring it. Doing nothing — like I did — is not a good option.",
              "attribution": "Lou Franco (The Pragmatic Engineer Newsletter, Sept 2024)"
            },
            {
              "text": "I got laid off during the pandemic from a job I worked at for 8 years with no raises and found a new job at 33% higher pay within two weeks. I learned not to let companies take advantage of me.",
              "attribution": "u/zakabog, Reddit r/sysadmin"
            }
          ],
          "postAngles": [
            "Share what your best engineers actually care about (hint: not ping pong)",
            "Tell a story about losing a great engineer and what you learned",
            "Create a retention checklist that goes beyond compensation",
            "Address the link between tech debt and attrition"
          ]
        }
      ],
      "realQuotes": [
        {
          "topic": "Tech debt causing attrition",
          "source": "Pragmatic Engineer, exit interviews",
          "context": "Engineers leaving because debt is ignored"
        },
        {
          "topic": "90% firefighting mode",
          "source": "Reddit r/sysadmin, The New Stack",
          "context": "Teams trapped in reactive cycles"
        },
        {
          "topic": "IC to manager identity crisis",
          "source": "Dev.to, LeadDev",
          "context": "Losing technical edge while leading"
        },
        {
          "topic": "Retention beyond compensation",
          "source": "Reddit r/sysadmin, industry forums",
          "context": "What actually keeps engineers engaged"
        }
      ],
      "topicCalendar": [
        {
          "category": "Technical Debt Strategy",
          "frequency": "1x per week",
          "whenToPost": "When you see tech debt discussions, modernization announcements, or refactoring debates",
          "painPointsAddressed": [
            1
          ],
          "templateSuggestions": [
            "Hot Take",
            "Story Post",
            "Myth Buster"
          ],
          "exampleTopics": [
            "The tech debt that caused my best engineer to leave",
            "Unpopular opinion: Most tech debt doesn't need to be paid down",
            "How I got my CEO to fund 3 months of pure refactoring"
          ]
        },
        {
          "category": "Infrastructure & Operations",
          "frequency": "1x per week",
          "whenToPost": "When you see outage postmortems, infrastructure complaints, or DevOps discussions",
          "painPointsAddressed": [
            2
          ],
          "templateSuggestions": [
            "Value Bomb",
            "Listicle",
            "Observation"
          ],
          "exampleTopics": [
            "We went from 90% firefighting to 40%. Here's exactly how.",
            "5 automations that gave my team their weekends back",
            "I noticed every fast-growing startup has the same infra problem..."
          ]
        },
        {
          "category": "Engineering Leadership & Team Health",
          "frequency": "1x per week",
          "whenToPost": "When you see leadership transition posts, burnout discussions, or retention concerns",
          "painPointsAddressed": [
            3,
            4
          ],
          "templateSuggestions": [
            "Question Post",
            "Story Post",
            "Signal Post"
          ],
          "exampleTopics": [
            "Quick question: How do you stay technical as an engineering leader?",
            "I stopped coding 2 years ago. Here's what I gained (and lost).",
            "3 signs your engineers are about to leave"
          ]
        }
      ],
      "proTips": {
        "superpower": "You've led large engineering teams through scaling challenges. You understand both the technical and people sides of engineering leadership.",
        "uniqueVoice": [
          "You're honest about the ugly parts of engineering management",
          "You've lived the firefighting cycle and found your way out",
          "You can translate between technical depth and business impact"
        ],
        "avoid": [
          "Pure technical tutorials (leave that to IC engineers)",
          "Generic management advice without engineering context",
          "Pretending everything is fine when your audience is struggling"
        ],
        "leanInto": [
          "Specific metrics and ratios (firefighting %, debt paydown ROI)",
          "Honest stories about failures and what you learned",
          "Frameworks for making hard tradeoff decisions",
          "Empathy for the IC-to-leader transition struggle"
        ],
        "bestTimes": "Tuesday–Thursday, 7-9am or 5-7pm CT",
        "engagementHack": "When commenting on engineering posts, share a specific before/after metric. Example: 'We had the same firefighting problem — went from 85% reactive to 45% by [specific change]. Happy to share the playbook.'"
      },
      "closingMotivation": "Your audience is exhausted from firefighting, frustrated by tech debt politics, and questioning their career transition to leadership. Validate their struggle with your own scars and give them tactical wins."
    },
    {
      "id": "cyril-jones",
      "name": "Cyril Jones",
      "title": "VP of Scoped Projects",
      "avatar": "CJ",
      "profileImage": "https://i.imgur.com/tBvFpOY.jpg",
      "offering": "Scoped Projects",
      "nicheStatement": "You speak to operations leaders and founders running fixed-scope project delivery — those balancing speed, quality, and cost while trying to build scalable project operations from scratch.",
      "icp": {
        "title": "Scaling founders, VPs of Engineering, Operations Directors, Agency owners",
        "targetRoles": [
          "Scaling Founders",
          "VPs of Engineering",
          "Operations Directors",
          "Agency Owners",
          "Small Business Owners"
        ],
        "companyStage": "10–200 employees; agencies, consultancies, or product companies outsourcing project work",
        "industry": "Digital agencies, SaaS, professional services, AI/tech consulting",
        "situation": "Running fixed-scope client engagements; struggling with scope creep; building project operations; exploring AI transformation projects",
        "theyrePostingAbout": [
          "Scope creep horror stories",
          "Fixed-price project challenges",
          "Client expectation management",
          "AI transformation project scoping"
        ],
        "servicesFocus": [
          "Scoped"
        ]
      },
      "connectCriteria": [
        "Run or manage fixed-scope client projects",
        "Post about scope creep, pricing challenges, or project profitability",
        "Mention needing a dev partner for specific deliverables",
        "Are exploring AI transformation projects without clear scope",
        "Active in agency, consulting, or project management communities"
      ],
      "engageCriteria": [
        "Generally interested in project management best practices",
        "Share concerns about client relationships or delivery challenges",
        "Post about estimation, pricing, or scope definition",
        "Discuss AI implementation or digital transformation"
      ],
      "painPoints": [
        {
          "id": 1,
          "title": "Scope creep silently destroys project profitability",
          "whyItMatters": "52% of projects experience scope creep, with an average cost overrun of 27%. The word 'just' is scope creep's best friend — small client requests accumulate into massive unbilled work.",
          "quotes": [
            {
              "text": "'Can we just add a dropdown here?' 'Can we just change how this navigation works?' The word 'just' minimizes the perceived complexity, making requests seem trivial. Clients aren't trying to be manipulative — they genuinely don't understand the technical implications… Fixed-price projects that double in scope without corresponding budget adjustments become money-losing ventures.",
              "attribution": "@michelle_turner (Nuvoro Digital), DEV Community"
            },
            {
              "text": "I found myself working longer hours, juggling new features I hadn't priced for, and watching the project grow way beyond what I'd signed up for… Scope creep isn't just about clients asking for more — it's about the developer not setting boundaries.",
              "attribution": "@debugger360, DEV Community"
            }
          ],
          "postAngles": [
            "Share your 'scope creep early warning system' — red flags to watch for",
            "Tell a story about a project that went 2x over scope and what you learned",
            "Create a script for responding to 'can we just...' requests",
            "Outline your change request process that protects profitability"
          ]
        },
        {
          "id": 2,
          "title": "Accurate pricing for fixed-scope projects is nearly impossible",
          "whyItMatters": "Estimating complex digital projects accurately is described as 'gambling.' Experience helps, but most estimates are a work of fiction.",
          "quotes": [
            {
              "text": "I am sure you have read unrealistic articles that suggest there is some scientific approach to pricing that will magically allow you to create an accurate quote… Estimating a project comes down to intuition, experience, and an educated guess! As anybody who has worked in the field for any time will tell you, most estimates are a work of fiction.",
              "attribution": "Paul Boag, Smashing Magazine (25+ years industry experience)"
            },
            {
              "text": "A project kicks off with high hopes and a healthy-looking margin… But when the dust settles and you run the numbers, the profit you expected has vanished. This quiet erosion of agency profitability happens when small, untracked deviations accumulate over weeks or months.",
              "attribution": "Glencoyne (agency finance consultants)"
            }
          ],
          "postAngles": [
            "Share your actual estimation accuracy rate (be honest)",
            "Tell a story about a project you massively underpriced and what you changed",
            "Create an estimation framework that accounts for unknowns",
            "Address when to walk away from a project that can't be priced safely"
          ]
        },
        {
          "id": 3,
          "title": "Clients can't articulate what they need until they see it",
          "whyItMatters": "Digital projects are abstract until tangible. Clients agree to specs, then realize what's missing once they see prototypes — creating perpetual scope expansion.",
          "quotes": [
            {
              "text": "Clients often struggle to articulate exactly what they need at the project's start. It's only when clients see the initial designs or working prototypes that they can clearly envision the final product — and recognize what's missing. A client might agree that their website needs a 'contact page,' not realizing they also need a location finder, a service request form, an emergency contact option, and integration with their CRM system.",
              "attribution": "@michelle_turner, DEV Community"
            }
          ],
          "postAngles": [
            "Share your discovery process that prevents 'I'll know it when I see it'",
            "Tell a story about a client who completely changed direction after seeing v1",
            "Create a requirements checklist that forces clarity upfront",
            "Address how to price discovery vs. delivery separately"
          ]
        },
        {
          "id": 4,
          "title": "Building a team for scoped work — the hiring tightrope",
          "whyItMatters": "Finding talent with the right skill level for fixed-cost work is a persistent challenge. Too senior is too expensive, too junior is too slow. Over-hiring leads to overstaffing during project lulls.",
          "quotes": [
            {
              "text": "The most difficult challenge we faced was hiring and getting the right people in the right seats. It's easy to hire when you're consistently bringing in new business, but if that new business slows down, you can be overstaffed very quickly. You need to be very slow to hire until you're absolutely sure you need that role.",
              "attribution": "Unnamed entrepreneur (Spectup startup scaling guide)"
            }
          ],
          "postAngles": [
            "Share your 'bench calculation' — how much bench time is acceptable",
            "Tell a story about overhiring that hurt your business",
            "Create a framework for deciding when to hire vs. partner",
            "Address the economics of senior vs. junior talent for scoped work"
          ]
        },
        {
          "id": 5,
          "title": "AI transformation projects have no clear definition of 'done'",
          "whyItMatters": "95% of AI pilots fail to deliver expected value. Organizations know AI can transform their business but can't define scope, deliverables, or success criteria.",
          "quotes": [
            {
              "text": "There is — rightfully — little patience for 'exploratory' AI investments. Each dollar spent should fuel measurable outcomes. But many agentic deployments last year didn't deliver much value. If you asked for a demo — to see an agent at work delivering value — you often couldn't get it because there wasn't anything to see.",
              "attribution": "PwC, AI Predictions 2026"
            }
          ],
          "postAngles": [
            "Share how to scope an AI project when the client doesn't know what they want",
            "Tell a story about an AI project that had no clear 'done' and how you fixed it",
            "Create a framework for defining AI project success criteria",
            "Address when to say 'no' to an AI project that can't be scoped"
          ]
        }
      ],
      "realQuotes": [
        {
          "topic": "Scope creep profitability killer",
          "source": "DEV Community, agency forums",
          "context": "'Can we just...' destroying margins"
        },
        {
          "topic": "Estimation is fiction",
          "source": "Smashing Magazine, Glencoyne",
          "context": "25+ year veterans admitting estimates are guesses"
        },
        {
          "topic": "Clients don't know what they want",
          "source": "DEV Community, project managers",
          "context": "Specs change after prototypes"
        },
        {
          "topic": "AI projects with no 'done'",
          "source": "PwC AI Predictions 2026",
          "context": "95% of AI pilots fail to deliver value"
        }
      ],
      "topicCalendar": [
        {
          "category": "Scope & Pricing Strategy",
          "frequency": "1x per week",
          "whenToPost": "When you see scope creep complaints, pricing discussions, or project post-mortems",
          "painPointsAddressed": [
            1,
            2
          ],
          "templateSuggestions": [
            "Hot Take",
            "Story Post",
            "Listicle"
          ],
          "exampleTopics": [
            "The 3-word phrase that's killing your project margins ('can we just...')",
            "I lost $40K on a project because I didn't do this one thing",
            "5 signs your project is already in scope creep (before the client asks)"
          ]
        },
        {
          "category": "Client Management & Discovery",
          "frequency": "1x per week",
          "whenToPost": "When you see client relationship posts, discovery discussions, or requirements gathering content",
          "painPointsAddressed": [
            3
          ],
          "templateSuggestions": [
            "Value Bomb",
            "Myth Buster",
            "Question Post"
          ],
          "exampleTopics": [
            "How we get clients to know what they want (before they see the prototype)",
            "Myth: Clients change their minds because they're difficult. Truth: We failed at discovery.",
            "Quick question: How do you handle 'I'll know it when I see it'?"
          ]
        },
        {
          "category": "AI Project Scoping",
          "frequency": "1x per week",
          "whenToPost": "When you see AI hype, transformation discussions, or failed pilot stories",
          "painPointsAddressed": [
            5
          ],
          "templateSuggestions": [
            "Signal Post",
            "Observation",
            "Story Post"
          ],
          "exampleTopics": [
            "4 signs an AI project will never have a clear 'done'",
            "I noticed every failed AI project had the same scoping problem...",
            "The AI project we killed after 2 weeks (and why it was the right call)"
          ]
        }
      ],
      "proTips": {
        "superpower": "You've built a scoped projects division from scratch. You understand the economics of fixed-price work intimately — the margins, the risks, the client dynamics.",
        "uniqueVoice": [
          "You're honest about how hard pricing and scoping really is",
          "You've lost money on projects and can share those lessons",
          "You bridge technical delivery with business operations"
        ],
        "avoid": [
          "Pretending scoping is easy or scientific",
          "Blaming clients for scope creep (it's a partnership problem)",
          "Generic project management advice without financial context"
        ],
        "leanInto": [
          "Specific numbers: margins, overruns, estimation accuracy",
          "Honest failure stories that teach",
          "Frameworks for having hard conversations with clients",
          "The business side of project delivery (not just PM methodology)"
        ],
        "bestTimes": "Tuesday–Thursday, 8-10am or 1-3pm CT",
        "engagementHack": "When commenting on project posts, share a specific margin or overrun number. Example: 'We had a similar project go 2.3x over scope. The fix was separating discovery from delivery pricing — happy to share our SOW template.'"
      },
      "closingMotivation": "Your audience is tired of losing money on projects that sounded good in the proposal. Share your scars, your numbers, and your frameworks for making scoped work actually profitable."
    },
    {
      "id": "dom-paulk",
      "name": "Dom Paulk",
      "title": "Senior Product Manager",
      "avatar": "DP",
      "profileImage": "https://i.imgur.com/vMT5jR9.jpg",
      "offering": "Embedded Teams",
      "nicheStatement": "You speak to product managers and team leads navigating the chaos of cross-functional alignment — specifically those managing mixed teams of contractors, embedded members, and full-time staff while fighting Agile dysfunction.",
      "icp": {
        "title": "Product Managers, Heads of Product, Team Leads, Scrum Masters",
        "targetRoles": [
          "Product Managers",
          "Heads of Product",
          "Team Leads",
          "Scrum Masters",
          "Product Ops"
        ],
        "companyStage": "50–1,000 employees using contractors or embedded team models",
        "industry": "SaaS, tech, enterprise software, consultancies with embedded teams",
        "situation": "Managing stakeholder conflicts; running Agile processes that feel broken; unifying mixed teams; improving delivery velocity",
        "theyrePostingAbout": [
          "Stakeholder alignment nightmares",
          "Agile process frustrations",
          "Contractor and team integration",
          "Delivery velocity challenges"
        ],
        "servicesFocus": [
          "Embedded"
        ]
      },
      "connectCriteria": [
        "Manage product teams with mixed full-time and contractor members",
        "Post about stakeholder alignment or prioritization challenges",
        "Mention Agile process frustrations or ceremony overhead",
        "Are looking to improve delivery velocity without adding headcount",
        "Active in product management communities"
      ],
      "engageCriteria": [
        "Generally interested in product management best practices",
        "Share concerns about team dynamics or process improvements",
        "Post about Agile methodology or tooling discussions",
        "Discuss roadmap planning or feature prioritization"
      ],
      "painPoints": [
        {
          "id": 1,
          "title": "Stakeholder misalignment and competing priorities",
          "whyItMatters": "33% of product managers cite aligning strategy as their biggest scaling challenge. Engineering, sales, leadership, and users pull in conflicting directions, making prioritization a constant battle.",
          "quotes": [
            {
              "text": "One of the biggest challenges I faced as a product manager in 2024 was managing competing priorities among stakeholders. Engineering might advocate for technical feasibility and debt reduction, sales push for quick-win features to close deals, leadership focuses on long-term roadmap goals, and users want immediate solutions to their pain points.",
              "attribution": "Lilian Ekpere, Senior Product Manager at SeamHealth Innovations (The Top Voices Roundtable, Feb 2025)"
            },
            {
              "text": "I'm not surprised by the many examples of companies whose product teams don't really follow the tenets espoused by groups such as the Pragmatic Institute… Why don't they just cut the BS and have R&D teams work directly with executives to get things accomplished?",
              "attribution": "Disenchanted Product Manager, Reddit r/ProductManagement"
            }
          ],
          "postAngles": [
            "Share your prioritization framework when everyone's #1 is different",
            "Tell a story about a stakeholder conflict you navigated successfully",
            "Create a 'stakeholder translation guide' for common conflicts",
            "Address how to say 'no' without damaging relationships"
          ]
        },
        {
          "id": 2,
          "title": "Agile has become ritualistic and disconnected from value delivery",
          "whyItMatters": "Practitioners express deep frustration with how Agile/Scrum is implemented in practice. It becomes process-heavy theater rather than a tool for value delivery.",
          "quotes": [
            {
              "text": "I can't take this Agile crap any longer. It has all the hallmarks of a religion. A lot of literature, a lot of disciples, hoards of money grabbing snake oil selling evangelists, and no evidence at all that it works.",
              "attribution": "tomelders, Hacker News"
            },
            {
              "text": "Yep, companies spool up Jira and suddenly claim they are agile.",
              "attribution": "Reddit r/Agile user"
            },
            {
              "text": "Instead of fixing dysfunctional management and team structures they reinforce them. The roles have new names but everyone just falls back into their old behaviours. Nothing really changes, we just have new meetings and new buzzwords.",
              "attribution": "lucisferre, Hacker News"
            }
          ],
          "postAngles": [
            "Share what 'Agile that works' actually looks like in practice",
            "Tell a story about killing ceremonies that weren't adding value",
            "Create a 'ceremony audit' — which meetings to keep, kill, or change",
            "Address why most Agile implementations fail (and what to do instead)"
          ]
        },
        {
          "id": 3,
          "title": "Managing contractor and embedded team dynamics",
          "whyItMatters": "Product managers struggle with outsourced and embedded team quality control, Agile integration, and cultural cohesion. Contracts aren't designed for agile workflows, and risk spikes whenever work is outsourced.",
          "quotes": [
            {
              "text": "External dependencies (outsourced work), controlling for the quality of that work and managing it in an agile way. Contracts (SOWs) are usually not agile. Whenever anything is outsourced… risk spikes.",
              "attribution": "Anonymous Product Manager, Quora"
            },
            {
              "text": "The problem is, I'm just a lowly developer. I don't get a say in the matter. It's forced upon me. It's not the idiot who reads a book who has to make this stuff work, it's people like me.",
              "attribution": "tomelders, Hacker News"
            }
          ],
          "postAngles": [
            "Share your framework for integrating contractors into Agile teams",
            "Tell a story about embedded team dynamics — what worked and what didn't",
            "Create an onboarding checklist for contractors that actually works",
            "Address the 'us vs. them' dynamic between FTEs and contractors"
          ]
        },
        {
          "id": 4,
          "title": "Building a business case for process changes with no clear ROI metric",
          "whyItMatters": "Leadership now demands 110% conviction in product bets. Getting buy-in for process improvements without clear revenue impact is increasingly difficult.",
          "quotes": [
            {
              "text": "Building more substantial business cases for product features tied directly to revenue instead of having an option to focus on engagement/adoption growth… leadership sought not 100%, but 110% conviction in priorities.",
              "attribution": "Daria Beliakova, Senior Product Manager at Monday.com (The Top Voices Roundtable, Feb 2025)"
            },
            {
              "text": "25% of the product managers who participated in our poll said that scaling development processes faster is the biggest pain point for them as their company grows.",
              "attribution": "ProductPlan survey"
            }
          ],
          "postAngles": [
            "Share how you built a business case for process changes",
            "Tell a story about getting buy-in for a 'soft' improvement",
            "Create a template for quantifying process improvement ROI",
            "Address when to just do it vs. when to ask for permission"
          ]
        }
      ],
      "realQuotes": [
        {
          "topic": "Stakeholder conflict exhaustion",
          "source": "LinkedIn Top Voices, Reddit r/ProductManagement",
          "context": "33% of PMs cite alignment as biggest challenge"
        },
        {
          "topic": "Agile theater frustration",
          "source": "Hacker News, Reddit r/Agile",
          "context": "'Jira = Agile' dysfunction"
        },
        {
          "topic": "Contractor integration challenges",
          "source": "Quora, Hacker News",
          "context": "SOWs aren't designed for Agile"
        },
        {
          "topic": "110% conviction requirements",
          "source": "Monday.com PM, ProductPlan",
          "context": "Process improvements need revenue ties"
        }
      ],
      "topicCalendar": [
        {
          "category": "Stakeholder Alignment",
          "frequency": "1x per week",
          "whenToPost": "When you see prioritization debates, stakeholder conflict posts, or roadmap discussions",
          "painPointsAddressed": [
            1
          ],
          "templateSuggestions": [
            "Hot Take",
            "Story Post",
            "Question Post"
          ],
          "exampleTopics": [
            "The meeting that finally aligned my 4 stakeholders with different #1 priorities",
            "Unpopular opinion: Most stakeholder conflicts are prioritization failures, not communication failures",
            "Quick question: How do you handle 'but Sales said this is urgent'?"
          ]
        },
        {
          "category": "Agile Reality Check",
          "frequency": "1x per week",
          "whenToPost": "When you see Agile frustration posts, ceremony complaints, or process discussions",
          "painPointsAddressed": [
            2
          ],
          "templateSuggestions": [
            "Myth Buster",
            "Listicle",
            "Observation"
          ],
          "exampleTopics": [
            "Myth: More ceremonies = more Agile. Truth: Most of your meetings are waste.",
            "5 Agile ceremonies we killed and what we replaced them with",
            "I noticed every team with 'Agile theater' has the same root cause..."
          ]
        },
        {
          "category": "Team Dynamics & Process",
          "frequency": "1x per week",
          "whenToPost": "When you see contractor integration posts, team culture discussions, or process improvement content",
          "painPointsAddressed": [
            3,
            4
          ],
          "templateSuggestions": [
            "Value Bomb",
            "Story Post",
            "Signal Post"
          ],
          "exampleTopics": [
            "How we integrated 5 contractors into our Agile team without chaos",
            "The process change I made without asking permission (and why it worked)",
            "3 signs your embedded team isn't actually integrated"
          ]
        }
      ],
      "proTips": {
        "superpower": "You've managed mixed teams of contractors and FTEs. You understand the real-world messiness of Agile in practice, not just the theory.",
        "uniqueVoice": [
          "You're honest about Agile's failures in practice",
          "You've lived the contractor integration struggle",
          "You can translate between IC frustration and leadership priorities"
        ],
        "avoid": [
          "Agile evangelism or methodology debates",
          "Generic PM advice without operational specifics",
          "Pretending mixed teams are easy to manage"
        ],
        "leanInto": [
          "Specific tactics for stakeholder alignment",
          "Honest stories about process failures and fixes",
          "Frameworks for contractor integration",
          "The political side of product management"
        ],
        "bestTimes": "Tuesday–Thursday, 8-10am or 12-2pm CT",
        "engagementHack": "When commenting on PM posts, share a specific process or ceremony you changed. Example: 'We had the same stakeholder alignment issue — fixed it by replacing weekly status meetings with async updates + one 20-min decision meeting.'"
      },
      "closingMotivation": "Your audience is drowning in Agile theater and stakeholder conflicts. Validate their frustration and give them specific tactics they can try this sprint."
    },
    {
      "id": "jesse-kinzer",
      "name": "Jesse Kinzer",
      "title": "Marketing Manager",
      "avatar": "JK",
      "profileImage": "https://i.imgur.com/ECjkXNc.jpg",
      "offering": "Embedded Teams",
      "nicheStatement": "You speak to small-to-midsize marketing teams building scalable demand gen engines — specifically those leveraging AI and automation (Clay, Zapier, vibe coding) to punch above their weight without sacrificing content authenticity.",
      "icp": {
        "title": "Solo marketers, CMOs, Heads of Demand Gen at lean teams",
        "targetRoles": [
          "Marketers (solo or small team)",
          "CMOs",
          "Heads of Demand Gen",
          "Marketing Ops Leaders"
        ],
        "companyStage": "10–300 employees with marketing teams of 1–5 people",
        "industry": "SaaS, B2B tech, startups, professional services",
        "situation": "Overwhelmed solo marketers; drowning in tool sprawl; struggling to produce content at scale; trying to prove marketing ROI",
        "theyrePostingAbout": [
          "Marketing burnout and overwhelm",
          "Tool stack simplification",
          "AI content vs. authentic content",
          "Attribution challenges"
        ],
        "servicesFocus": [
          "Embedded"
        ]
      },
      "connectCriteria": [
        "Are solo marketers or lead teams of 1-5 people",
        "Post about doing too much with too little resources",
        "Mention marketing automation tools or AI content challenges",
        "Struggle with attribution or proving marketing ROI",
        "Active in B2B marketing or demand gen communities"
      ],
      "engageCriteria": [
        "Generally interested in marketing automation and AI tools",
        "Share concerns about content quality or production capacity",
        "Post about marketing strategy or campaign performance",
        "Discuss MarTech stack or tool consolidation"
      ],
      "painPoints": [
        {
          "id": 1,
          "title": "Small marketing teams are drowning and burning out",
          "whyItMatters": "83% of marketing professionals report burnout — the highest rate of any corporate function. Solo marketers and small teams try to cover every channel with minimal resources.",
          "quotes": [
            {
              "text": "I've been that person juggling everything — drafting LinkedIn posts while replying to leads, writing a blog post with one hand and prepping sales follow-ups with the other… I'd hit end of the day, kids telling me I was absent, while I'd look back at what I actually got done, and realize strategy — funnel review, campaign planning, big-picture thinking — was nowhere on the board. Again.",
              "attribution": "Mark Tanko, solo marketer/founder (Medium, 2025)"
            },
            {
              "text": "I've probably had 10 sessions in the last two months where people have come and burst into tears. They are so overwhelmed.",
              "attribution": "Andrew Garrihy, former Huawei Global Chief Brand Officer (Marketing Week, 2026)"
            }
          ],
          "postAngles": [
            "Share your 'essential vs. optional' marketing activity framework",
            "Tell a story about burnout and what you changed",
            "Create a 'marketing triage' checklist for overwhelmed teams",
            "Address what to stop doing without guilt"
          ]
        },
        {
          "id": 2,
          "title": "Marketing automation tool overwhelm and integration chaos",
          "whyItMatters": "Marketers use 5–10+ platforms that don't integrate well, spending more time managing the tech stack than actually marketing. Analysis paralysis around tool selection is pervasive.",
          "quotes": [
            {
              "text": "I wish someone had told me to start simple and scale up.",
              "attribution": "Aggregated from 100+ Reddit posts on r/smallbusiness, r/entrepreneur, r/marketing"
            },
            {
              "text": "The companies winning in 2025 aren't using the most tools — they're using the right tools effectively. Simple, consistent automation beats complex, broken workflows every single time.",
              "attribution": "Reddit-aggregated insight"
            }
          ],
          "postAngles": [
            "Share your 'minimal viable MarTech stack' recommendation",
            "Tell a story about killing tools that weren't adding value",
            "Create a tool audit checklist — what to keep, consolidate, or kill",
            "Address the hidden cost of tool sprawl (time, not just money)"
          ]
        },
        {
          "id": 3,
          "title": "AI content quality versus authentic human creativity",
          "whyItMatters": "Marketers face a paradox: they need more content, but AI outputs feel generic and lack the human touch that builds trust. Reddit communities have doubled their AI content rules in 16 months.",
          "quotes": [
            {
              "text": "You have to come up with the right prompts... Then you often need to edit the output, because let's face it, the first draft from AI can be a little off — maybe too generic, or the tone isn't quite human enough.",
              "attribution": "Mark Tanko, solo marketer (Medium, 2025)"
            },
            {
              "text": "It's often hard to detect and we do see it as very disruptive to the actual running of the site… [AI content] tries to meet the substance and depth of a typical post… however, there are frequent glaring errors in both style and content.",
              "attribution": "Reddit moderators (Cornell University study)"
            }
          ],
          "postAngles": [
            "Share your framework for 'AI-assisted, human-finished' content",
            "Tell a story about AI content that flopped and what you learned",
            "Create guidelines for where AI helps vs. hurts authenticity",
            "Address the audience trust implications of AI content"
          ]
        },
        {
          "id": 4,
          "title": "Demand gen attribution is a black box nobody can explain",
          "whyItMatters": "Multi-touch attribution is the #2 challenge for marketers globally. CMOs are held accountable for results they can't clearly measure.",
          "quotes": [
            {
              "text": "Try as you might, multi-source attribution models are black boxes you can't begin to explain, and when you can't explain them, people — read: your boss — start to ask questions.",
              "attribution": "Metadata.io"
            },
            {
              "text": "Attribution will never be perfect. Buyers today might see a LinkedIn post, hear a podcast, and Google your brand three weeks later. That journey doesn't show up in a neat linear model.",
              "attribution": "Search Engine Journal"
            }
          ],
          "postAngles": [
            "Share your 'good enough' attribution approach for small teams",
            "Tell a story about defending marketing ROI without perfect data",
            "Create a framework for what to measure vs. what to accept as unmeasurable",
            "Address how to have honest attribution conversations with leadership"
          ]
        },
        {
          "id": 5,
          "title": "Content demand outpaces capacity at an accelerating rate",
          "whyItMatters": "B2B companies now juggle 10 channels (double from 8 years ago) while 78% report teams of just 1–3 people. As much as 70% of B2B content goes unused.",
          "quotes": [
            {
              "text": "Content is so much better when it's firsthand data or firsthand stories. And as a team of one, that can be hard to prioritize.",
              "attribution": "Ash Read, Editorial Director at Buffer (Animalz blog)"
            },
            {
              "text": "I've done the interviews, I've come up with the messaging, the branding, I've written the landing page copy, and no one else has touched it. And I was just like, this isn't okay!",
              "attribution": "Ash Read (Animalz blog)"
            }
          ],
          "postAngles": [
            "Share your content repurposing system that multiplies output",
            "Tell a story about saying 'no' to a channel and what happened",
            "Create a 'content leverage' framework — create once, use many",
            "Address the 70% unused content problem and how to fix it"
          ]
        }
      ],
      "realQuotes": [
        {
          "topic": "Marketing burnout crisis",
          "source": "Medium, Marketing Week",
          "context": "83% burnout rate — highest corporate function"
        },
        {
          "topic": "Tool sprawl paralysis",
          "source": "Reddit aggregation, Salesforce",
          "context": "More time managing tools than marketing"
        },
        {
          "topic": "AI content authenticity gap",
          "source": "Medium, Cornell study",
          "context": "Communities doubling AI content rules"
        },
        {
          "topic": "Attribution black box",
          "source": "Metadata.io, Search Engine Journal",
          "context": "Can't explain models to leadership"
        }
      ],
      "topicCalendar": [
        {
          "category": "Marketing Team Survival",
          "frequency": "1x per week",
          "whenToPost": "When you see burnout posts, 'doing too much' complaints, or capacity discussions",
          "painPointsAddressed": [
            1,
            5
          ],
          "templateSuggestions": [
            "Story Post",
            "Listicle",
            "Question Post"
          ],
          "exampleTopics": [
            "I was drowning as a solo marketer. Here's what I stopped doing.",
            "5 marketing activities I cut that didn't hurt results",
            "Quick question: What would you stop doing if you could?"
          ]
        },
        {
          "category": "MarTech & Automation",
          "frequency": "1x per week",
          "whenToPost": "When you see tool recommendation requests, stack discussions, or automation content",
          "painPointsAddressed": [
            2
          ],
          "templateSuggestions": [
            "Hot Take",
            "Value Bomb",
            "Myth Buster"
          ],
          "exampleTopics": [
            "Unpopular opinion: Most marketers need fewer tools, not better tools",
            "My 3-tool marketing stack that does 90% of what I need",
            "Myth: More automation = more efficiency. Truth: More automation = more complexity to manage."
          ]
        },
        {
          "category": "AI & Content Strategy",
          "frequency": "1x per week",
          "whenToPost": "When you see AI content debates, authenticity discussions, or attribution complaints",
          "painPointsAddressed": [
            3,
            4
          ],
          "templateSuggestions": [
            "Observation",
            "Story Post",
            "Signal Post"
          ],
          "exampleTopics": [
            "I noticed AI-generated LinkedIn posts all sound the same. Here's how to fix yours.",
            "The AI content that flopped and what I do differently now",
            "3 signs your attribution model is giving you false confidence"
          ]
        }
      ],
      "proTips": {
        "superpower": "You understand both the strategic and tactical sides of lean marketing. You've built systems that let small teams punch above their weight.",
        "uniqueVoice": [
          "You're honest about marketing burnout and resource constraints",
          "You blend AI/automation with authentic human creativity",
          "You've been the solo marketer doing everything — you get it"
        ],
        "avoid": [
          "Enterprise marketing advice that doesn't apply to small teams",
          "Pure tool recommendations without workflow context",
          "Pretending AI can replace human creativity entirely"
        ],
        "leanInto": [
          "Specific systems and workflows for lean teams",
          "Honest stories about what didn't work",
          "The human side of AI-assisted marketing",
          "Practical attribution approaches for imperfect data"
        ],
        "bestTimes": "Tuesday–Thursday, 7-9am or 12-2pm CT",
        "engagementHack": "When commenting on marketing posts, share a specific tool or workflow that saved you time. Example: 'We had the same content capacity issue — solved it by repurposing one blog post into 5 LinkedIn posts + 1 newsletter. Happy to share the template.'"
      },
      "closingMotivation": "Your audience is exhausted, overwhelmed, and being asked to do more with less. Validate their struggle, share your shortcuts, and give them permission to stop doing things that don't matter."
    },
    {
      "id": "ryan-doss",
      "name": "Ryan Doss",
      "title": "CTO",
      "avatar": "RD",
      "profileImage": "https://i.imgur.com/kAeqec9.jpg",
      "offering": "Embedded Teams",
      "nicheStatement": "You speak to technical leaders evaluating and implementing AI-powered development tools — specifically CTOs navigating the gap between AI coding tool hype and production-grade reliability.",
      "icp": {
        "title": "CTOs, Technical Founders, Engineering Leads evaluating AI tools",
        "targetRoles": [
          "CTOs",
          "Technical Founders",
          "Engineering Leads",
          "VPs of Engineering"
        ],
        "companyStage": "20–500 employees building software products",
        "industry": "SaaS, fintech, healthtech, developer tooling, enterprise software",
        "situation": "Evaluating AI coding tools (Copilot, Cursor, etc.); managing code quality with AI; making architecture decisions for AI-native apps; justifying AI tooling ROI",
        "theyrePostingAbout": [
          "AI coding tool evaluations",
          "Code quality with AI assistance",
          "AI tool ROI justification",
          "Security concerns with AI tools"
        ],
        "servicesFocus": [
          "Embedded"
        ]
      },
      "connectCriteria": [
        "Are actively evaluating or using AI coding tools",
        "Post about AI code quality, productivity, or security concerns",
        "Mention struggling to prove AI tooling ROI",
        "Make architecture decisions for AI-native applications",
        "Active in CTO or engineering leadership communities"
      ],
      "engageCriteria": [
        "Generally interested in AI development tool trends",
        "Share concerns about AI code quality or security",
        "Post about developer productivity or tooling decisions",
        "Discuss technical debt from AI-generated code"
      ],
      "painPoints": [
        {
          "id": 1,
          "title": "AI generates 70% of the code by volume but not 70% of the solution",
          "whyItMatters": "66% of developers cite AI code quality as their biggest frustration. AI produces code that looks right but introduces subtle bugs, creating a false sense of progress.",
          "quotes": [
            {
              "text": "It's more like it can generate 70% of the code by volume, rather than get you 70% of the way to a complete solution. 12 week projects don't become 4 week projects, at best they are 9-10 week projects.",
              "attribution": "jeremyjh, Hacker News (Dec 2024)"
            },
            {
              "text": "Following the logic of genAI code is complicated by the fact that AI can make different mistakes than humans do, and it speaks/documents with much more authority, both of which make it not only more difficult to spot issues, but make it difficult in a frustrating way.",
              "attribution": "happytoexplain, Hacker News (Sept 2024)"
            }
          ],
          "postAngles": [
            "Share your framework for measuring real AI productivity (not lines of code)",
            "Tell a story about AI code that looked right but broke production",
            "Create guidelines for which tasks AI helps vs. hurts",
            "Address the '70% problem' — volume vs. value"
          ]
        },
        {
          "id": 2,
          "title": "AI tooling creates a new form of technical debt",
          "whyItMatters": "GitClear tracked an 8x increase in duplicated code blocks in AI-assisted repos during 2024. AI produces code faster but creates systems nobody fully understands.",
          "quotes": [
            {
              "text": "AI tech debt is created because no one really understands those systems. So we will have systems that no one understands, not even the person who submits the PR.",
              "attribution": "Senior developer, Reddit r/ExperiencedDevs"
            },
            {
              "text": "AI is like a brand new credit card here that is going to allow us to accumulate technical debt in ways we were never able to do before.",
              "attribution": "Prof. Armando Solar-Lezama, MIT (Wall Street Journal)"
            }
          ],
          "postAngles": [
            "Share how you track and manage AI-generated tech debt",
            "Tell a story about AI debt that bit you later",
            "Create an 'AI code review checklist' for your team",
            "Address the 'nobody understands this code' problem"
          ]
        },
        {
          "id": 3,
          "title": "Proving ROI on AI coding tools is extremely difficult",
          "whyItMatters": "The METR 2025 study found experienced developers using AI tools were actually 19% slower — even though they felt 20% faster. Only 1 in 4 AI initiatives deliver expected ROI.",
          "quotes": [
            {
              "text": "It will be challenging to prove the ROI of AI tooling. It all sounds great, but it's difficult to measure how much more productive a developer or a team is without slowing them down.",
              "attribution": "Rupert Colbourne, CTO of Orbus Software (DEVOPSdigest)"
            },
            {
              "text": "If the tool doesn't reduce the menial and the mundane work of an engineer, it won't be adopted. This is where the 'fad' aspect of the industry will struggle. 'AI is just a fad' will be shouted from the rooftops because tools that were purchased simply didn't solve the core problems.",
              "attribution": "Sterling Chin, Senior Developer Advocate at Postman (DEVOPSdigest)"
            }
          ],
          "postAngles": [
            "Share your AI tooling ROI framework (what actually matters)",
            "Tell a story about justifying AI tool spend to your board",
            "Create metrics that capture real productivity, not perceived productivity",
            "Address the 'feeling faster vs. being faster' paradox"
          ]
        },
        {
          "id": 4,
          "title": "AI tools fail at the work that matters most — complexity management",
          "whyItMatters": "AI handles boilerplate well but fails at architectural decisions, cross-cutting concerns, and system-level complexity. Only 29% of developers say AI handles complex tasks well (down from 35% in 2024).",
          "quotes": [
            {
              "text": "AI is a fabulous tool… But it can't do the essential work of complexity management for the same reason it can't prove an unproven maths problem. As it stands we still need human brains to do those things.",
              "attribution": "neilwilson, Hacker News (Dec 2024)"
            },
            {
              "text": "In the next 10-15 years I'm either going to be a CTO going around cleaning up after AI, or maybe they're not going to need people like me anymore because we're just going to write the specs and generate the whole app from scratch every time.",
              "attribution": "Meri Williams, CTO at Pleo (Aviator Blog)"
            }
          ],
          "postAngles": [
            "Share where AI helps your team vs. where it creates problems",
            "Tell a story about AI failing at architectural complexity",
            "Create guidelines for 'AI-assisted' vs. 'human-led' tasks",
            "Address the future of the CTO role in an AI-assisted world"
          ]
        },
        {
          "id": 5,
          "title": "Security risks from AI-generated code are accelerating",
          "whyItMatters": "40% of AI-generated code contains vulnerabilities. GitHub repos with Copilot enabled leak secrets at 6.4% versus 4.6% for standard repos. Speed gains come at a real security cost.",
          "quotes": [
            {
              "text": "Developers learned the hard way that rapid adoption can pose serious security and reliability challenges… MCP's flexible architecture created a Wild West of potentially untrusted code, where community-published servers could be backdoored or abandoned.",
              "attribution": "Gil Feig, CTO of Merge (The New Stack)"
            },
            {
              "text": "[The challenge is] if they can secure applications at the same velocity that they're building them… [AI tools] often run in an unmanaged or 'headless' capacity. This makes developers the last line of defense.",
              "attribution": "Cristian Rodriguez, Field CTO at CrowdStrike (Fortune)"
            }
          ],
          "postAngles": [
            "Share your AI code security review process",
            "Tell a story about a security issue in AI-generated code you caught",
            "Create an AI security checklist for your team",
            "Address the speed vs. security tradeoff honestly"
          ]
        }
      ],
      "realQuotes": [
        {
          "topic": "70% code, not 70% solution",
          "source": "Hacker News, developer forums",
          "context": "Volume vs. value mismatch"
        },
        {
          "topic": "AI tech debt explosion",
          "source": "GitClear, MIT research, WSJ",
          "context": "8x increase in duplicated code"
        },
        {
          "topic": "Feeling faster ≠ being faster",
          "source": "METR 2025 study, DEVOPSdigest",
          "context": "19% slower while feeling 20% faster"
        },
        {
          "topic": "AI fails at complexity",
          "source": "Hacker News, CTOs",
          "context": "Only 29% say AI handles complex tasks well"
        }
      ],
      "topicCalendar": [
        {
          "category": "AI Coding Tool Reality Check",
          "frequency": "1x per week",
          "whenToPost": "When you see AI productivity claims, tool announcements, or Copilot/Cursor discussions",
          "painPointsAddressed": [
            1,
            3
          ],
          "templateSuggestions": [
            "Hot Take",
            "Myth Buster",
            "Observation"
          ],
          "exampleTopics": [
            "Unpopular opinion: AI makes my team feel faster but they're not",
            "Myth: AI generates 70% of the code. Truth: It generates 70% of the volume.",
            "I noticed every CTO has the same AI productivity measurement problem..."
          ]
        },
        {
          "category": "AI Code Quality & Debt",
          "frequency": "1x per week",
          "whenToPost": "When you see code quality discussions, tech debt posts, or AI architecture debates",
          "painPointsAddressed": [
            2,
            4
          ],
          "templateSuggestions": [
            "Story Post",
            "Value Bomb",
            "Signal Post"
          ],
          "exampleTopics": [
            "The AI-generated code that passed review and broke production",
            "Our AI code review checklist that catches the subtle bugs",
            "4 signs you're accumulating AI tech debt faster than you realize"
          ]
        },
        {
          "category": "AI Security & Risk",
          "frequency": "1x per week",
          "whenToPost": "When you see AI security discussions, vulnerability reports, or risk management content",
          "painPointsAddressed": [
            5
          ],
          "templateSuggestions": [
            "Listicle",
            "Story Post",
            "Question Post"
          ],
          "exampleTopics": [
            "5 security issues we've caught in AI-generated code",
            "The vulnerability Copilot introduced that took us 3 days to find",
            "Quick question: How are you reviewing AI-generated code for security?"
          ]
        }
      ],
      "proTips": {
        "superpower": "You build AI tools AND evaluate them for production use. You understand both the promise and the reality of AI-assisted development.",
        "uniqueVoice": [
          "You're skeptical of AI hype but practical about adoption",
          "You've seen what works and what doesn't in production",
          "You can translate AI tooling decisions into business impact"
        ],
        "avoid": [
          "Pure AI hype or doom — stay balanced",
          "Generic productivity advice without AI context",
          "Dismissing AI entirely or embracing it uncritically"
        ],
        "leanInto": [
          "Specific metrics and measurements from your experience",
          "Honest assessments of where AI helps vs. hurts",
          "Security and quality concerns that others gloss over",
          "The CTO's perspective on AI adoption decisions"
        ],
        "bestTimes": "Tuesday–Thursday, 7-9am or 5-7pm CT",
        "engagementHack": "When commenting on AI coding posts, share a specific before/after measurement. Example: 'We tracked this — our team felt 25% faster but cycle time only improved 8%. The gap was review and debugging time.'"
      },
      "closingMotivation": "Your audience is being pressured to adopt AI tools but can't prove ROI and worries about quality. Give them frameworks for making smart decisions and honest data about what actually works."
    },
    {
      "id": "scott-blevins",
      "name": "Scott Blevins",
      "title": "Director of AI",
      "avatar": "SB",
      "profileImage": "https://i.imgur.com/OwDU6RY.jpg",
      "offering": "Embedded Teams",
      "nicheStatement": "You speak to technical and business leaders caught between the pressure to deploy AI and the reality that most AI initiatives fail — you help them cut through hype and implement AI that actually works.",
      "icp": {
        "title": "CTOs, VPs of Engineering, Founders, COOs, Heads of Innovation",
        "targetRoles": [
          "CTOs",
          "VPs of Engineering",
          "Technical Founders",
          "COOs",
          "Heads of Innovation",
          "Product Leaders"
        ],
        "companyStage": "50–2,000 employees, mid-market to enterprise",
        "industry": "Enterprise software, professional services, financial services, healthcare, manufacturing, SaaS",
        "situation": "Under board/executive pressure to 'do something with AI' but lack clarity on where to start. Skeptical of vendor promises, worried about security, struggling to justify ROI. Many have tried AI pilots that went nowhere.",
        "theyrePostingAbout": [
          "AI ROI and business value",
          "AI pilot failures and lessons",
          "AI security concerns",
          "Build vs. buy AI decisions"
        ],
        "servicesFocus": [
          "Embedded"
        ]
      },
      "connectCriteria": [
        "Are evaluating build vs. buy for their first AI implementation",
        "Have an AI pilot that's been running 6+ months with no clear path to production",
        "Are concerned about security/compliance implications of AI adoption",
        "Need to present an AI strategy to their board but don't know where to start",
        "Are dealing with 'shadow AI' (employees using unauthorized AI tools)",
        "Are technical enough to spot BS but need practical frameworks for AI adoption"
      ],
      "engageCriteria": [
        "Are generally interested in AI trends and technical architecture",
        "Share concerns about AI hype, security, or implementation challenges",
        "Post about development velocity, technical debt, or modernization efforts",
        "Are wrestling with organizational change management around new technology",
        "Lead technical teams exploring AI tools for development"
      ],
      "painPoints": [
        {
          "id": 1,
          "title": "AI Hype vs. Business Value — The ROI Gap",
          "whyItMatters": "Less than 30% of AI leaders report their CEOs are happy with AI investment returns. 95% of AI pilots fail to deliver measurable value. Companies chase AI because of FOMO, not because they've identified a problem worth solving.",
          "quotes": [
            {
              "text": "Here's this great new thing that we can use now, let's go out and find a use for it. What you really want to be doing is finding a problem to solve with it first.",
              "attribution": "Stuart King, CTO of AnzenSage (CIO.com)"
            },
            {
              "text": "LLMs might be really useful, but as far as I can see all the AI companies are not making money on inference alone. We might be hitting plateau in capabilities with money being raised on vision of being this godlike tech that will change the world completely. Sooner or later the costs will have to meet the reality.",
              "attribution": "dejv, Hacker News (Dec 2025)"
            },
            {
              "text": "There is — rightfully — little patience for 'exploratory' AI investments. Each dollar spent should fuel measurable outcomes. But many agentic deployments last year didn't deliver much value. If you asked for a demo — to see an agent at work delivering value — you often couldn't get it because there wasn't anything to see.",
              "attribution": "PwC, AI Predictions 2026"
            }
          ],
          "postAngles": [
            "Share your framework for 'problem-first AI adoption' vs. 'solution-looking-for-a-problem'",
            "Tell a story about an AI pilot you killed early (and why that was the right call)",
            "Break down the math: what does 'AI ROI' actually mean in practical terms?",
            "Call out specific vendor claims that don't match reality",
            "Share a decision tree: 'Should you even be investing in AI right now?'"
          ]
        },
        {
          "id": 2,
          "title": "AI-Generated Code Creates More Problems Than It Solves",
          "whyItMatters": "AI coding tools promise 10x developer productivity, but the reality is messier. GitClear found an 8x increase in duplicated code blocks in AI-assisted repos. Code gets written faster but creates bottlenecks in review, QA, and maintenance.",
          "quotes": [
            {
              "text": "Sure, code gen is faster now. And the industry might finally be waking up to the fact that writing code is a small part of producing software. Getting infinitely faster at one step doesn't speed up the overall process. In fact, there's good evidence that rapid code gen actually slows down other steps like code review and QA.",
              "attribution": "perrygeo, Hacker News (Dec 2025)"
            },
            {
              "text": "So much wasted time debating whether the 1000 lines of generated code are actually necessary when the actual transform in question is 3 of them. 'But it works,' goes the refrain.",
              "attribution": "binary132, Hacker News (Dec 2025)"
            },
            {
              "text": "It's more like it can generate 70% of the code by volume, rather than get you 70% of the way to a complete solution. 12 week projects don't become 4 week projects, at best they are 9-10 week projects.",
              "attribution": "jeremyjh, Hacker News (Dec 2024)"
            }
          ],
          "postAngles": [
            "Share how you measure actual AI developer productivity (beyond 'lines of code')",
            "Tell a cautionary tale about AI-generated code that passed review but broke production",
            "Explain where AI tools shine vs. where they create more work",
            "Outline your team's AI code review checklist",
            "Address the question: 'Should we even be tracking AI usage on our team?'"
          ]
        },
        {
          "id": 3,
          "title": "AI Security & Data Privacy Concerns Are Spiking",
          "whyItMatters": "69% of leaders cite AI data privacy concerns (up from 43% in just 6 months). 40% of AI-generated code contains vulnerabilities. Shadow AI — unauthorized tools employees are using — creates massive hidden risk.",
          "quotes": [
            {
              "text": "With many organizations, it's very easy to slap a credit card down and procure cloud services and procure additional AI services. But you're invariably putting the organization at risk by doing that.",
              "attribution": "Brassor, technology leader (RSM US)"
            },
            {
              "text": "Early adopters approached these tools with a mix of excitement and scepticism. Many now report declining trust in output accuracy. They've encountered too many subtle bugs, too many instances where plausible looking code concealed logical errors or security vulnerabilities.",
              "attribution": "Reddit r/ExperiencedDevs developer sentiment (Medium compilation)"
            },
            {
              "text": "[The challenge is] if they can secure applications at the same velocity that they're building them… [AI tools] often run in an unmanaged or 'headless' capacity. This makes developers the last line of defense.",
              "attribution": "Cristian Rodriguez, Field CTO at CrowdStrike (Fortune)"
            }
          ],
          "postAngles": [
            "Share your organization's AI security policy template",
            "Explain how to do a 'shadow AI audit' (and what you'll probably find)",
            "Walk through a specific vulnerability you caught in AI-generated code",
            "Compare security risks: AI coding tools vs. Stack Overflow copy-paste",
            "Create a decision framework: when is AI data exposure acceptable vs. not?"
          ]
        },
        {
          "id": 4,
          "title": "Build vs. Buy Decisions for AI Are Agonizing",
          "whyItMatters": "Building custom AI costs $600K–$1.5M per agent. Buying accelerates time-to-value but introduces vendor lock-in and integration nightmares. 46% of tech leaders cite AI skill gaps as a barrier.",
          "quotes": [
            {
              "text": "You want to experiment quickly to understand how complex the problem really is. Sometimes you discover it's more feasible to buy and get to market fast.",
              "attribution": "Alex Tyrrell, CTO of Health at Wolters Kluwer (CIO.com)"
            },
            {
              "text": "Embedding an agent in a transactional workflow means customers expect near-instant results. Even small delays create a bad experience, and understanding the source of latency in a vendor solution can be difficult.",
              "attribution": "Alex Tyrrell (CIO.com)"
            },
            {
              "text": "AI tech debt is created because no one really understands those systems. So we will have systems that no one understands, not even the person who submits the PR.",
              "attribution": "Senior developer, Reddit r/ExperiencedDevs"
            }
          ],
          "postAngles": [
            "Share your 'build vs. buy' decision matrix for AI",
            "Tell a story: when you chose to build and it was right (or wrong)",
            "Break down hidden costs of both paths (not just upfront price)",
            "Explain what questions to ask AI vendors that expose whether they're real or vaporware",
            "Address: 'We don't have ML engineers — should we even try to build?'"
          ]
        },
        {
          "id": 5,
          "title": "Organizations Don't Know Where to Start With AI",
          "whyItMatters": "Only 13% of companies are actually ready to leverage AI to its full potential, despite 85% saying they have less than 18 months to deploy AI or face negative business effects. The 'death by use case' problem.",
          "quotes": [
            {
              "text": "Achieving ROI demands immense effort, vision, and commitment, and many enterprises simply aren't equipped to overcome their internal barriers. Hype won't close the gap between ambition and implementation.",
              "attribution": "David S. Linthicum, former CTO/CEO (InfoWorld)"
            },
            {
              "text": "CIOs and CTOs should be the antidote to the 'death by use case' frenzy that we already see in many companies.",
              "attribution": "McKinsey, 'Technology's generational moment with generative AI'"
            }
          ],
          "postAngles": [
            "Share your 'AI readiness assessment' (3-5 questions leaders should ask first)",
            "Create a prioritization framework: which use cases to tackle first",
            "Tell the story of how you picked your first AI project (and what you learned)",
            "Address the elephant: 'What if AI isn't right for your business right now?'",
            "Explain how to build an AI strategy when you're not an AI expert"
          ]
        }
      ],
      "realQuotes": [
        {
          "topic": "AI productivity paradox",
          "source": "Hacker News, Reddit r/ExperiencedDevs",
          "context": "Developers feel faster but data shows they're not — AI code requires more review time"
        },
        {
          "topic": "Shadow AI is our biggest risk",
          "source": "CIO forums, RSM US research",
          "context": "Employees using unauthorized AI tools with company data"
        },
        {
          "topic": "Where do we even start?",
          "source": "McKinsey, InfoWorld",
          "context": "Enterprises paralyzed by too many AI use cases, unclear prioritization"
        },
        {
          "topic": "Vendor demos vs. production reality",
          "source": "CIO.com, Hacker News",
          "context": "Beautiful demos that don't match integration complexity"
        },
        {
          "topic": "AI skill gap is blocking us",
          "source": "Multiple CTO forums",
          "context": "46% of leaders say they lack in-house AI expertise to build"
        }
      ],
      "topicCalendar": [
        {
          "category": "AI Adoption Strategy",
          "frequency": "1x per week",
          "whenToPost": "After board meetings (Q1, Q2, Q3, Q4), when competitors announce AI features, when major AI news breaks",
          "painPointsAddressed": [
            1,
            5
          ],
          "templateSuggestions": [
            "Hot Take",
            "Value Bomb",
            "Question Post"
          ],
          "exampleTopics": [
            "The 3 questions I ask before any AI investment",
            "Your board wants AI — here's what to say",
            "Why most AI strategies fail in the first 90 days"
          ]
        },
        {
          "category": "AI Security & Governance",
          "frequency": "1x per week",
          "whenToPost": "After security incidents make headlines, during budget/planning season, when new AI regulations are announced",
          "painPointsAddressed": [
            3
          ],
          "templateSuggestions": [
            "Signal Post",
            "Listicle",
            "Observation"
          ],
          "exampleTopics": [
            "Shadow AI audit: what we found in our first sweep",
            "5 AI security risks your CISO isn't thinking about",
            "How to write an AI usage policy people actually follow"
          ]
        },
        {
          "category": "AI Implementation Reality",
          "frequency": "1x per week",
          "whenToPost": "During project retrospectives, when you see unrealistic vendor claims, after successful (or failed) AI deployments",
          "painPointsAddressed": [
            2,
            4
          ],
          "templateSuggestions": [
            "Story Post",
            "Myth Buster",
            "Value Bomb"
          ],
          "exampleTopics": [
            "We killed our $400K AI project — here's what went wrong",
            "AI coding tools: where they shine vs. where they break",
            "The hidden costs of 'buying' vs. 'building' AI"
          ]
        }
      ],
      "proTips": {
        "superpower": "You've built AI tools from scratch AND advised businesses on adoption. You speak both languages — technical and strategic.",
        "uniqueVoice": [
          "You're not selling AI hype — you're helping people navigate it realistically",
          "You've seen both successful and failed implementations firsthand",
          "You can translate technical AI complexity into business decision frameworks"
        ],
        "avoid": [
          "Overly academic AI discussions (leave that to researchers)",
          "Pure vendor bashing (be critical but fair)",
          "Doom-and-gloom 'AI will replace everyone' takes"
        ],
        "leanInto": [
          "Practical, battle-tested frameworks",
          "Honest assessments of what works and what doesn't",
          "Specific numbers and real examples from your work",
          "Questions that prompt your audience to think differently"
        ],
        "bestTimes": "Tuesday–Thursday, 7-9am or 12-2pm CT",
        "engagementHack": "When you comment on others' posts, add value by sharing a specific counter-perspective or framework, not just agreement. Example: 'Interesting take. I'd add that when we see this pattern, it usually means [specific insight].'"
      },
      "closingMotivation": "Your audience is drowning in AI hype and desperately needs someone who can cut through it with honesty and practical guidance. Be that voice."
    },
    {
      "id": "sonya-mead",
      "name": "Sonya Mead",
      "title": "Senior/Lead Recruiter",
      "avatar": "SM",
      "profileImage": "https://i.imgur.com/kDxpvDj.jpg",
      "offering": "Recruiting",
      "nicheStatement": "You speak to hiring leaders and decision-makers struggling with engineering recruitment — specifically those dealing with broken interview processes, AI-generated resumes, and the widening gap between what hiring managers want and what the talent market offers.",
      "icp": {
        "title": "HR Directors, Heads of Talent, VPs of People, Hiring Managers",
        "targetRoles": [
          "HR Directors",
          "Heads of Talent",
          "VPs of People",
          "Hiring Managers (engineering)",
          "Talent Acquisition Leads"
        ],
        "companyStage": "50–1,000 employees actively hiring engineers",
        "industry": "SaaS, tech, fintech, any company with significant engineering hiring needs",
        "situation": "Losing candidates to slow processes; struggling to screen AI-enhanced resumes; misaligned with hiring managers on requirements; under pressure on time-to-hire and cost-per-hire",
        "theyrePostingAbout": [
          "Interview process length and complexity",
          "AI-generated resume challenges",
          "Recruiter/hiring manager misalignment",
          "Candidate experience and ghosting"
        ],
        "servicesFocus": [
          "Recruiting"
        ]
      },
      "connectCriteria": [
        "Are actively hiring engineers and struggling with process",
        "Post about interview length, candidate drop-off, or process inefficiency",
        "Mention AI-generated resumes or screening challenges",
        "Deal with recruiter/hiring manager misalignment",
        "Are concerned about employer brand impact from candidate experience"
      ],
      "engageCriteria": [
        "Generally interested in recruiting and talent acquisition trends",
        "Share concerns about hiring market or candidate quality",
        "Post about interview best practices or employer branding",
        "Discuss recruiting tools, ATS systems, or screening methods"
      ],
      "painPoints": [
        {
          "id": 1,
          "title": "Hiring processes are too long and lose top candidates",
          "whyItMatters": "Engineering interviews routinely stretch to 5–8+ rounds over weeks or months, causing top candidates to drop out. The process is widely seen as toxic and antiquated.",
          "quotes": [
            {
              "text": "Interviews upon interviews, frivolous personality quizzes, unscheduled hour-long calls to discuss said quizzes, team/roundtable interviews with a half a dozen people grilling you and throwing you curveballs, creative submissions galore (requiring substantial unpaid work).",
              "attribution": "Anonymous (viral Reddit post, r/TrueOffMyChest, 3,500+ comments)"
            },
            {
              "text": "They said it would be two rounds. It turned into six, plus a reference check before the final.",
              "attribution": "Anonymous, Reddit r/AskHR"
            }
          ],
          "postAngles": [
            "Share how you cut your interview process length (and what you learned)",
            "Tell a story about losing a great candidate to process length",
            "Create a 'process audit' checklist for identifying unnecessary steps",
            "Address the tradeoff between thoroughness and speed"
          ]
        },
        {
          "id": 2,
          "title": "Recruiters and hiring managers are fundamentally misaligned",
          "whyItMatters": "63% of hiring managers feel recruiters don't understand the jobs they recruit for. Hiring managers give vague requirements then reject candidates for not meeting unstated criteria.",
          "quotes": [
            {
              "text": "We're consistently hearing that recruiters and hiring managers aren't on the same page… Corporate recruiters are well familiar with the 'where's my candidates?' response from hiring managers, yet they can't get fast and accurate feedback on the candidates they've already submitted.",
              "attribution": "Jason Webster, co-founder of Ongig"
            },
            {
              "text": "Why should I spend my time talking to candidates? I don't want to waste my time on intro calls. Candidates should join me because I am an ex-MAANG. Send them a coding test first, if they pass it, I will talk to them.",
              "attribution": "Typical hiring manager response documented by TalentNauts blog"
            }
          ],
          "postAngles": [
            "Share your framework for getting real requirements from hiring managers",
            "Tell a story about misalignment that cost you a hire",
            "Create an 'intake meeting' checklist that prevents vague requirements",
            "Address how to push back on unrealistic hiring manager expectations"
          ]
        },
        {
          "id": 3,
          "title": "AI-generated resumes have broken the screening process",
          "whyItMatters": "25–57% of resumes now show signs of AI generation, making skill assessment from paper nearly impossible. Traditional screening no longer works.",
          "quotes": [
            {
              "text": "ChatGPT resumes accounted for 30%+ of the ones we just received. Any ideas on how to vet the candidate without it being an interrogation? We are seeing a lot of candidates applying for senior devops positions using ChatGPT to create their resumes.",
              "attribution": "Anonymous hiring manager, Reddit r/ExperiencedDevs"
            },
            {
              "text": "Most [recruiters] are bad. The good ones, instead of spending time on tasks for which they're uniquely qualified, are instead stuck at the top of the funnel sourcing engineers whose qualifications they don't have the domain expertise to evaluate.",
              "attribution": "Aline Lerner, founder of interviewing.io"
            }
          ],
          "postAngles": [
            "Share how you screen for signal when resumes are AI-generated",
            "Tell a story about catching an AI-embellished candidate",
            "Create alternative screening methods that bypass resume reliance",
            "Address what AI resumes mean for the future of screening"
          ]
        },
        {
          "id": 4,
          "title": "The hiring bar in engineering is staggeringly inefficient",
          "whyItMatters": "Companies conduct 10–30 onsite interviews per hire, wasting enormous recruiter and engineer time. 76% of employers globally struggle to fill technical roles.",
          "quotes": [
            {
              "text": "Primarily in the Engineering world we hear that the bar is too high. It's common to hear that it takes 10-15 onsite interviews to get a hire. We've even heard as high as 25-30 onsite interviews to get to a hire. That could be up to 90 hours of recruiting time without an actual hire.",
              "attribution": "Jason Webster, Ongig"
            }
          ],
          "postAngles": [
            "Share your 'interviews per hire' ratio and how you improved it",
            "Tell a story about an overly high bar that hurt your hiring",
            "Create a framework for calibrating the right hiring bar",
            "Address when 'high standards' becomes 'unrealistic expectations'"
          ]
        },
        {
          "id": 5,
          "title": "Ghosting candidates destroys employer brand in tight-knit engineering communities",
          "whyItMatters": "Companies routinely ghost candidates after multiple interview rounds, and word travels fast in engineering communities (Reddit, Hacker News, Blind). Recruiters are overwhelmed managing 15–50 open requisitions simultaneously.",
          "quotes": [
            {
              "text": "The thing that blows my mind is that almost zero companies call you back to tell you that you didn't get the job, even after you've interviewed one or multiple times. They seriously don't give a single [expletive] about you as a person.",
              "attribution": "u/ZipZopZoopittyBop, Reddit r/TrueOffMyChest"
            },
            {
              "text": "Even with the best intentions, I've slipped up. I've ghosted (by accident), delayed feedback, and sent a vague rejection. Not because I didn't care, but because I was too busy to realize how much it mattered.",
              "attribution": "Jyoti Yadav, Recruiting Lead (Medium, July 2025)"
            }
          ],
          "postAngles": [
            "Share your system for never ghosting a candidate",
            "Tell an honest story about accidentally ghosting and what you changed",
            "Create a 'candidate communication' checklist for high-volume recruiting",
            "Address the employer brand cost of ghosting (with specific examples)"
          ]
        }
      ],
      "realQuotes": [
        {
          "topic": "5-8 round interview gauntlets",
          "source": "Reddit r/TrueOffMyChest (viral post)",
          "context": "Candidates exhausted by endless process"
        },
        {
          "topic": "Recruiter/HM misalignment",
          "source": "Ongig research, TalentNauts",
          "context": "63% of HMs feel recruiters don't understand the role"
        },
        {
          "topic": "30%+ AI-generated resumes",
          "source": "Reddit r/ExperiencedDevs, hiring managers",
          "context": "Traditional screening broken"
        },
        {
          "topic": "10-30 interviews per hire",
          "source": "Ongig industry data",
          "context": "Staggering inefficiency in engineering hiring"
        },
        {
          "topic": "Ghosting destroys brand",
          "source": "Reddit, Medium",
          "context": "Word travels fast in engineering communities"
        }
      ],
      "topicCalendar": [
        {
          "category": "Interview Process Efficiency",
          "frequency": "1x per week",
          "whenToPost": "When you see process complaints, candidate experience posts, or hiring timeline discussions",
          "painPointsAddressed": [
            1,
            4
          ],
          "templateSuggestions": [
            "Hot Take",
            "Listicle",
            "Story Post"
          ],
          "exampleTopics": [
            "Unpopular opinion: Your 6-round interview process is why you can't hire",
            "We cut our engineering interviews from 8 rounds to 3. Here's what happened.",
            "The candidate who got away because of our process (and what we changed)"
          ]
        },
        {
          "category": "Recruiter-HM Alignment",
          "frequency": "1x per week",
          "whenToPost": "When you see hiring manager complaints, requirement discussions, or sourcing challenges",
          "painPointsAddressed": [
            2
          ],
          "templateSuggestions": [
            "Value Bomb",
            "Question Post",
            "Myth Buster"
          ],
          "exampleTopics": [
            "The intake meeting framework that finally aligned me with my hiring managers",
            "Quick question: How do you get hiring managers to give you real requirements?",
            "Myth: Hiring managers know what they want. Truth: They know it when they see it."
          ]
        },
        {
          "category": "Modern Screening & Candidate Experience",
          "frequency": "1x per week",
          "whenToPost": "When you see AI resume discussions, candidate ghosting complaints, or employer brand content",
          "painPointsAddressed": [
            3,
            5
          ],
          "templateSuggestions": [
            "Observation",
            "Signal Post",
            "Story Post"
          ],
          "exampleTopics": [
            "I noticed 30% of our resumes now look AI-generated. Here's how we're adapting.",
            "4 signs your candidate experience is hurting your employer brand",
            "I accidentally ghosted a candidate. Here's the system I built so it never happens again."
          ]
        }
      ],
      "proTips": {
        "superpower": "You specialize in engineering recruitment — you understand the technical hiring landscape and the unique challenges of hiring developers.",
        "uniqueVoice": [
          "You're honest about recruiting's broken processes",
          "You understand both recruiter and candidate perspectives",
          "You can translate engineering requirements into actionable sourcing"
        ],
        "avoid": [
          "Generic HR advice that doesn't apply to technical hiring",
          "Blaming candidates or hiring managers exclusively",
          "Pretending recruiting is easy or straightforward"
        ],
        "leanInto": [
          "Specific metrics (time-to-hire, interviews per hire, offer acceptance)",
          "Honest stories about mistakes and what you learned",
          "Tactical advice for managing high-volume technical recruiting",
          "The candidate experience perspective (you're their advocate too)"
        ],
        "bestTimes": "Tuesday–Thursday, 8-10am or 12-2pm CT",
        "engagementHack": "When commenting on recruiting posts, share a specific metric or process change. Example: 'We had the same ghosting problem — implemented a 48-hour SLA on all candidate communication and our Glassdoor reviews improved within 2 months.'"
      },
      "closingMotivation": "Your audience is overwhelmed with requisitions and frustrated by broken processes. Help them work smarter, treat candidates better, and actually fill roles without burning out."
    }
  ]
}
